{"id":13,"public_id":"","hash":"256d88d9e22cf9a138818b21a35ce766","text":"We pursue fervor as youths, but crave mediocrity as adults.","word_tokens":[{"text":"We","is_masked":true},{"text":" ","is_masked":false},{"text":"pursue","is_masked":true},{"text":" ","is_masked":false},{"text":"fervor","is_masked":true},{"text":" ","is_masked":false},{"text":"as","is_masked":true},{"text":" ","is_masked":false},{"text":"youths","is_masked":true},{"text":",","is_masked":false},{"text":" ","is_masked":false},{"text":"but","is_masked":true},{"text":" ","is_masked":false},{"text":"crave","is_masked":true},{"text":" ","is_masked":false},{"text":"mediocrity","is_masked":true},{"text":" ","is_masked":false},{"text":"as","is_masked":true},{"text":" ","is_masked":false},{"text":"adults","is_masked":true},{"text":".","is_masked":false}],"audio_url":"https://cdn.jsdelivr.net/gh/soft-rocks/soapstone-cdn@main/sentence/256d88d9e22cf9a138818b21a35ce766/audio.wav","translations":[{"id":13,"public_id":"019c5507-15e2-72ee-afba-bd48f0e5b8bd","locale":"zhtw","content":"少年時我們追求激情，成熟後卻迷戀平庸。"}],"words":[{"id":60,"public_id":"019c5509-bc3b-7850-999e-7fbae5342a8d","word":"pursue","locale":"zhtw","markdown":"### 單字分析  \n- **詞性**: 動詞  \n- **音標**: /pɜːrˈsjuː/  \n\n### 語境  \n在句子We pursue fervor as youths, but crave mediocrity as adults.中，\"pursue\" 表達的是年輕時對某種熱情、理想或目標的主動追求與投入。這裡的pursue並非指簡單地追求某物，而是強調一種持續性、熱情且帶有動力的行為，反映出年輕人充滿理想與衝動的特質。與後文crave mediocrity（渴望平庸）形成對比，凸顯出人生階段轉變中價值觀的變化。因此，在這個語境中，\"pursue\" 搭配fervor（熱情）時，傳達出一種主動、投入、不計得失的行動姿態，強調情感與精神上的投入，而非理性計算。\n\n### 定義與用法  \n1. 動詞，意為追求、致力於達到某個目標、理想或狀態，通常帶有持續性、熱情或投入的意味，可用於個人興趣、事業、價值觀或情感目標等情境。  \n2. 在此語境中，\"pursue\" 代表一種主動的、有目標的行為，強調行動力與內在驅動，與crave（渴望）不同，它不只表達需求，更強調行動與實踐。\n\n### English Examples  \n1. She has been pursuing her dream of becoming a marine biologist for over ten years.  \n\u003cbr\u003e*pursue在此作為動詞，描述她長期投入並持續行動以實現成為海洋生物學家的夢想，強調時間長度與行動的堅持性。*  \n2. The company is pursuing a new strategy to expand into emerging markets.  \n\u003cbr\u003e*pursue表示企業主動採取行動，以達成市場擴張的目標，凸顯策略性與組織層面的動力。*  \n3. He pursued art in his early twenties, even though it wasn’t financially stable.  \n\u003cbr\u003e*pursue在此說明他選擇以藝術為人生方向，即使面臨經濟風險，也展現出對熱情的忠誠與投入。*  \n\n### 同義字與延伸詞彙  \n- **同義字**:  \n\t- seek（更強調尋找，可能較中性）  \n\t- strive（強調努力，常與困難或挑戰相關）  \n\t- aim for（更側重目標設定，不強調過程）  \n- **反義字**:  \n\t- abandon（放棄）  \n\t- reject（拒絕）  \n- **相關片語**:  \n\t- pursue one's passion（追求熱情）  \n\t- pursue excellence（追求卓越）"},{"id":61,"public_id":"019c5509-bc40-7d23-b19e-be882a9b2849","word":"fervor","locale":"zhtw","markdown":"### 單字分析  \n- **詞性**: Noun（名詞）  \n- **音標**: /ˈfɜːvər/  \n\n### 語境  \n在句子We pursue fervor as youths, but crave mediocrity as adults.中，fervor描述年輕時對熱情、理想或追求的強烈投入與執著。這種狀態通常與激情、熱血、充滿動力的行動相關。年輕人往往擁有強烈的目標感與行動力，願意為夢想付出努力，因此fervor在此語境中強調一種內在的熱情與不倦的追求。與成年後更傾向於穩定、安全、無風險的生活形成對比，突顯了人生階段中價值觀的轉變。\n\n### 定義與用法  \n1. 指一種強烈的熱情、激情或投入感，通常與某種理想、信念或活動相關，表現為持續的動力與熱忱。  \n2. 用於描述個人對某種目標、興趣或價值觀的深切投入，常見於個人成長、學習或社會參與等情境中。\n\n### English Examples  \n1. She poured her entire life into her art, driven by an unrelenting fervor for beauty and expression.  \n\u003cbr\u003e*她將整個生命投入藝術之中，因對美與表達的強烈熱忱而持續奮鬥。此處fervor作為名詞，表達她對藝術創作的深層熱情，強調其內在動力與情感投入。*  \n2. The team showed a fierce fervor during the final match, pushing through exhaustion to win.  \n\u003cbr\u003e*球隊在決賽中展現出強烈的熱情，即使疲憊仍奮力拼搏以獲勝。此處fervor描述團隊在關鍵時刻的拼搏精神，體現出一種不屈不撓的態度。*  \n3. He didn’t have a plan, but his fervor for adventure led him to explore remote mountains.  \n\u003cbr\u003e*他沒有計畫，但對冒險的熱情帶他走進了偏遠的山區。此處fervor說明個人興趣如何驅動實際行動，展現出內在動機的影響力。*  \n\n### 同義字與延伸詞彙  \n- **同義字**:  \n  - passion（更強調情感上的熱愛，常與個人興趣或情感連結）  \n  - zeal（更強調行動上的積極與急切，常帶有衝動或短暫性）  \n  - enthusiasm（更偏向初期的興奮感，可能較不持久）  \n- **反義字**:  \n  - apathy（冷漠、無感）  \n  - indifference（漠不關心）  \n  - mediocrity（平庸，與熱情相反）  \n- **相關片語**:  \n  - fervor for justice（對正義的熱情）  \n  - fervor of youth（年輕時的熱血與激情）"},{"id":62,"public_id":"019c5509-bc41-7603-a787-86dbf96ff9ed","word":"youths","locale":"zhtw","markdown":"### 單字分析  \n- **詞性**: Noun（名詞）  \n- **音標**: /ˈjuːθz/  \n\n### 語境  \n在句子We pursue fervor as youths, but crave mediocrity as adults.中，\"youths\" 指的是年輕時的階段，特別是人在成長過程中的青少年或年輕成人時期。這個詞在此語境下強調的是個人在年少時期的熱情、理想與追求，與成年後的現實、妥協形成對比。因此，\"youths\" 不僅是一個時間上的標記，更蘊含了心理與價值觀的轉變——年輕人充滿熱忱，而成年人則傾向於安於平庸。這種用法突顯了人生階段的變化與內在動機的演進。\n\n### 定義與用法  \n\t1. 指年輕人，特別是青少年或剛成年的人，常在描述個人成長、價值觀或行為模式的轉變時使用。  \n\t2. 在文學或哲思語境中，\"youths\" 有時被用來象徵一種純粹、熱情、未受現實束縛的狀態，與成年後的理性或現實主義形成對比。\n\n### English Examples  \n1. During their youths, many students develop a passion for science and technology, which later shapes their career paths.  \n\u003cbr\u003e*\"youths\" 作為主詞，描述一群正在成長中的年輕人，強調他們在學習與探索過程中的熱情與興趣。*  \n2. The poet wrote about the joys and struggles of youths in a society that values success over happiness.  \n\u003cbr\u003e*\"youths\" 作為句子的主語，表達詩人對年輕一代生活狀態的觀察與情感投入，凸顯其社會背景與心理特質。*  \n3. In many cultures, the transition from youths to adults is marked by formal ceremonies or rites of passage.  \n\u003cbr\u003e*\"youths\" 作為名詞短語，指代社會中一個特定的發展階段，強調其與成人身份之間的轉折關係。*  \n\n### 同義字與延伸詞彙  \n- **同義字**:  \n\t- teenagers（更偏重年齡層，通常指13至19歲）  \n\t- young people（較為廣泛，可涵蓋任何年齡的年輕人）  \n\t- juveniles（多用於法律或社會學語境，帶有中性或負面色彩）  \n- **反義字**: adults（成年人，與年輕人形成對比）  \n- **相關片語**:  \n\t- in one's youth（在某人年輕時）  \n\t- the youth of society（社會的年輕一代）"},{"id":63,"public_id":"019c5509-bc41-79ee-b7c0-c5ee64422e65","word":"crave","locale":"zhtw","markdown":"### 單字分析  \n- **詞性**: Verb（動詞）  \n- **音標**: /kreɪv/  \n\n### 語境  \n在句子We pursue fervor as youths, but crave mediocrity as adults.中，crave描述成年人對平庸狀態的強烈渴望。這裡的crave並非指簡單的想要，而是表達一種深層、強烈、近乎本能的渴求，帶有情感上的不滿足與心理上的依賴。年輕時人們追求熱情與激情，但隨著年齡增長，反而更傾向於選擇安逸、中庸的生活方式。因此，crave在此語境中強調的是一種內在心理動機，反映出對某種生活狀態的深切向往，即使這種狀態可能被視為缺乏激勵或成長。  \n\n### 定義與用法  \n1. 表示對某種事物產生強烈、深層的渴望，通常帶有情感或心理上的需求，不一定是理性的選擇。  \n2. 常用於描述對某種情感、狀態、價值或生活方式的熱切追求，尤其在與個人成長、幸福或滿足感相關的情境中。  \n\n### English Examples  \n1. She craves peace after years of constant travel and chaos.  \n\u003cbr\u003e*她渴望平靜，因為多年來經歷了不斷的旅行與混亂。此句中，crave 用來表達對穩定與安寧的心理需求，強調一種內在的、持續性的渴望，而非偶發的興趣。*  \n2. Many young professionals crave recognition and promotion in their careers.  \n\u003cbr\u003e*許多年輕專業人士渴望在職業上獲得認可與晉升。這裡的 crave 表達了對職場成就的熱切追求，顯示出個人動機與社會期望之間的連結。*  \n3. The child craves attention from his parents, especially during quiet times.  \n\u003cbr\u003e*這個孩子在安靜時特別渴望父母的關注。此例說明 crave 可用於描述兒童心理發展中對情感連結的強烈需求，凸顯其情感深度與情境依賴性。*  \n\n### 同義字與延伸詞彙  \n- **同義字**:  \n\t- long for（更強調盼望，常帶有距離感或理想化）  \n\t- yearn for（情感更濃烈，多用於描述深切的、近乎痛苦的渴望）  \n\t- desire（較中性，可用於理性或感性的渴望）  \n- **反義字**:  \n\t- reject（拒絕）  \n\t- accept（接受）  \n- **相關片語**:  \n\t- crave for something（結構為 crave + for + 名詞，表達對某事物的渴望）  \n\t- crave freedom / love / success（常見搭配，強調對自由、愛或成功的深切追求）"},{"id":64,"public_id":"019c5509-bc41-7d07-afa2-b0e9d1028253","word":"mediocrity","locale":"zhtw","markdown":"### 單字分析  \n- **詞性**: Noun（名詞）  \n- **音標**: /ˌmɛdɪˈɒrətɪ/  \n\n### 語境  \n在句子We pursue fervor as youths, but crave mediocrity as adults.中，mediocrity指的是人在成長過程中，從年輕時追求熱情與卓越，轉向成年後更傾向於滿足於平庸、缺乏突破的狀態。這個詞在此語境中描繪了一種心理與價值觀的轉變——年輕時渴望激動與成就，而成年人則可能因現實壓力或安全感的考量，選擇接受中庸的生活方式，即使這意味著失去激情與冒險精神。因此，mediocrity並非單純指普通，而是帶有負面評價的安於平庸、缺乏追求的狀態。\n\n### 定義與用法  \n1. 指一種平庸、缺乏卓越或獨特特質的狀態，通常帶有輕微貶義，用來形容某人或某事未能達到理想或潛力水平。  \n2. 常用於描述個人價值觀、成就或表現時，表現出對極致追求的放棄，轉而選擇穩定但無創意或突破的結果。\n\n### English Examples  \n1. Many successful entrepreneurs started with a vision of transforming the world, but over time, most settled into mediocrity, content with routine business operations.  \n\u003cbr\u003e*許多成功創業者最初懷抱著改變世界的願景，但隨著時間推移，大多數人最終安於平庸，只滿足於日常的業務運作。此處mediocrity作為名詞，描述企業運營的狀態，表達一種對創新與突破的放棄。*  \n2. In a competitive field, students who consistently aim for excellence are more likely to achieve breakthroughs than those who accept mediocrity as a default.  \n\u003cbr\u003e*在競爭激烈的領域中，持續追求卓越的學生更有可能取得突破，而那些將平庸視為標準的人則容易止步不前。此處mediocrity作為抽象概念，用來對比excellence，強調價值選擇的差異。*  \n3. The film received mediocre reviews from critics, despite its ambitious plot and strong performances.  \n\u003cbr\u003e*這部電影雖有雄心勃勃的劇情和出色的演員表現，卻只獲得一般性的評價。此處mediocrity用來描述評論的結果，表達不突出、不特別的狀態，屬於中性偏負評價。*  \n\n### 同義字與延伸詞彙  \n- **同義字**:  \n\t- average（平均的，常指數值或表現，語氣較中性）  \n\t- banality（平庸的，強調缺乏新穎或創造性，語氣較強）  \n\t- stagnation（停滯，指狀態不進步，可視為一種結果）  \n- **反義字**:  \n\t- excellence（卓越）  \n\t- extraordinariness（非凡性）  \n- **相關片語**:  \n\t- live in mediocrity（安於平庸地生活）  \n\t- fall into mediocrity（墮入平庸）"},{"id":65,"public_id":"019c5509-bc42-70fa-a5a6-fda64c96922d","word":"adults","locale":"zhtw","markdown":"### 單字分析  \n- **詞性**: Noun（名詞）  \n- **音標**: /ˈædʌlt/  \n\n### 語境  \n在句子We pursue fervor as youths, but crave mediocrity as adults.中，adults指的是成年人，特指人在成長過程中從青少年階段進入成熟社會生活後的狀態。這個詞在語境中並非僅僅表示年齡層，更強調一種社會角色與心理狀態的轉變——年輕時熱衷於追求激情與理想，而當人成為成年人後，往往更傾向於選擇穩定、安全、不冒險的生活方式，因此crave mediocrity（渴望平庸）的說法暗含對成熟階段價值觀的反思。在此語境中，adults作為對比youths的對照，凸顯了人生階段的價值觀演變。\n\n### 定義與用法  \n1. 指生理或心理上已經成長為成年的人，通常指年滿18歲或以上，具備獨立生活與社會責任能力的個體。  \n2. 常用於描述個人在社會角色、行為模式或價值觀上的成熟階段，具有時間與社會功能的雙重意義。\n\n### English Examples  \n1. She decided to move to a new city as an adult, seeking better opportunities and a fresh start.  \n\u003cbr\u003e*adults在此作為主詞，表達個人在成長後做出重大人生決策的狀態，強調其獨立與自主的特質。*  \n2. Many adults today still struggle with work-life balance due to long working hours.  \n\u003cbr\u003e*adults作為主詞，描寫現代人面對職場壓力與個人生活之間的矛盾，反映社會結構對個人生活影響。*  \n3. The program is designed to help young people transition into adulthood with confidence.  \n\u003cbr\u003e*adults在此作為目標對象，說明該計畫旨在協助青少年邁向社會成熟階段，強調成長過程中的心理與社會準備。*  \n\n### 同義字與延伸詞彙  \n- **同義字**:  \n\t- grown-ups：較口語化，常用於日常對話中描述成年者，帶有親切感。  \n\t- mature individuals：較正式，強調心理成熟與理性判斷力。  \n\t- elders：多指年長者，可能超出成年的年齡範圍，語境更偏向社會地位。  \n- **反義字**: youths（青少年）  \n- **相關片語**:  \n\t- grow up（成長為成年人）  \n\t- adult life（成人生活）"}],"grammars":[{"id":78,"public_id":"019c5509-f755-7138-8e0b-79ffb70ffc00","category":"sentence pattern","value":"contrastive compound sentence","markdown":"**Structure:**  \n主句 + 但 + 另一句（表達對比的結果）  \n這種結構由兩個獨立的句子組成，使用but來連結，顯示兩種相反或對比的情況。兩個句子的主詞通常相同，但動作或狀態不同，強調轉變或矛盾。\n\n**Explanation:**  \ncontrastive compound sentence（對比複合句）是用來表現兩種截然不同的情況的句子結構。當我們想說某人年輕時做某事，但年長後改變了態度或行為時，這種結構能清楚傳達這種轉變。它不只說兩件事，更強調兩件事之間的對比，讓讀者感受到明顯的差異。\n\n**English Examples:**  \n1. She studied hard in college, but now she spends most of her time watching videos.  \n*年輕時她努力學習，現在卻花大部分時間看影片，顯示她生活習慣的明顯改變。*  \n2. He loved hiking in his twenties, but now he prefers staying indoors.  \n*他年輕時熱愛遠足，現在卻更喜歡待在屋裡，顯示興趣的轉變。*  \n3. We planned to travel around the world, but ended up staying at home.  \n*原本打算環遊世界，結果卻選擇留在家中，凸顯計畫與實際結果的落差。*","locale":"zhtw"},{"id":79,"public_id":"019c5509-f756-7687-9efd-c1ca1eb025eb","category":"tense","value":"present simple","markdown":"**Structure:**  \n主詞 + 現在分詞（present simple tense）\n\n**Explanation:**  \n現在簡單式（present simple）用來表示習慣性動作、普遍事實或持續性的狀態。它不強調時間點，而是傳達一種穩定、日常的行為或真實情況。這種時態常見於描述個人習慣、普遍真理或一般性觀察，例如我每天喝咖啡或水在100度時會開。它不表示過去、未來或進行中的動作，因此適合用來表達穩定的日常經驗或事實。\n\n**English Examples:**  \n1. She reads books every evening.  \n*她每晚都讀書，這是一個穩定的日常習慣。*  \n2. The sun rises in the east.  \n*太陽從東方升起，這是一個自然界的普遍事實。*  \n3. Children enjoy playing outside.  \n*孩子們喜歡在戶外玩耍，這是一種普遍的行為觀察。*","locale":"zhtw"},{"id":80,"public_id":"019c5509-f757-738e-a15f-5c07b75575a0","category":"part of speech","value":"pronoun: we","markdown":"**Structure:**  \n主詞 + 動詞 (或動詞短語)\n\n**Explanation:**  \n\"we\" 是一個人稱代名詞，用來指代說話者和其他人，通常在句子中作為主詞。它表示我們，用於描述一個包含說話者在內的群體行動或狀態。這個代名詞不需要任何後綴或改變形式，因為它是第一人稱複數，無論是在現在時、過去時或未來時中，\"we\" 都保持不變。它能幫助句子更簡潔，同時清楚地傳達我們這個群體的參與。\n\n**English Examples:**  \n1. We go to the park every weekend.  \n*我們每個週末都去公園。這句話中，\"we\" 代表說話者與其他人一起行動，說明共同的習慣。*  \n2. We studied hard for the exam.  \n*我們為考試努力學習。這裡的 \"we\" 表示一群人共同投入學習，強調集體努力。*  \n3. We decided to move to a new city.  \n*我們決定搬到一個新城市。\"we\" 用來表達一個群體做出的共同選擇，顯示集體決策。*","locale":"zhtw"},{"id":81,"public_id":"019c5509-f757-7b75-896c-533e4e9df1de","category":"part of speech","value":"verb: pursue","markdown":"**Structure:**  \n主詞 + 動詞 (原形)  \n\n**Explanation:**  \n動詞 \"pursue\" 是一個原形動詞，表示追求或致力於做某事。在句子中，當我們想表達某人正在積極地做某件事時，會使用這個原形動詞，特別是在一般現在時或一般過去時的主語之後。它不需要加 -s（如 he pursues）或過去分詞（如 pursued），除非句子結構需要時態變化或被動語態。原形動詞是構成句子的基本元素，讓我們能清楚表達行動的起點與方向。\n\n**English Examples:**  \n1. She pursues her dream with passion every day.  \n*她每天都以熱情追求她的夢想。這句話說明一個人持續努力實現目標，使用原形動詞 \"pursue\" 表達行動的持續性。*  \n2. The team pursues innovation in all projects.  \n*團隊在所有專案中都致力於創新。這裡 \"pursue\" 描述組織的長期目標與方向。*  \n3. Children pursue knowledge through reading.  \n*孩子透過閱讀來追求知識。此句強調學習的主動性與追求過程。*","locale":"zhtw"},{"id":82,"public_id":"019c5509-f758-71b1-8e6a-8252ebfb2a6f","category":"part of speech","value":"noun: fervor","markdown":"**Structure:**  \nnoun: fervor — a noun represents a thing, idea, or quality that can be named or described. \"Fervor\" specifically refers to strong passion, enthusiasm, or intense emotion, often in a positive or energetic context.\n\n**Explanation:**  \nIn English, nouns are used to name people, places, things, or ideas. \"Fervor\" is a noun that describes a powerful feeling of excitement or dedication. Unlike verbs or adjectives, it does not describe an action or a quality in a changing way — it stands alone as a concept that can be discussed, shared, or used in a sentence to express a strong emotional state.\n\n**English Examples:**  \n1. She showed great fervor in her dedication to the arts.  \n*她對藝術的投入展現了極高的熱忱。熱忱是她持續努力的動力。*  \n2. The team’s fervor during the final match inspired the crowd.  \n*球隊在決賽中的熱情激勵了觀眾。這顯示熱忱可以影響他人情緒。*  \n3. His fervor for learning new languages kept him awake at night.  \n*他對學習新語言的熱忱讓他晚上難以入眠。熱忱可以成為一種持續的驅動力。*","locale":"zhtw"},{"id":83,"public_id":"019c5509-f758-776a-904c-667808b66089","category":"part of speech","value":"preposition: as","markdown":"**Structure:**  \n主詞 + preposition (as) + 名詞或形容詞性成分  \n\n**Explanation:**  \n\"as\" 作為介詞時，表示像……一樣或在……的狀態下，後面通常接名詞、形容詞或名詞短語，用來描述某種類型、狀態或角色。它不表示時間或動作，而是說明某事物與另一事物之間的相似性或情境。例如，當我們說I act as a teacher，意思是我扮演老師的角色，其中as告訴我們這個動作是以某種身份進行的。\n\n**English Examples:**  \n1. She works as a nurse in the hospital.  \n*她以護士的身份在醫院工作。這裡的 \"as\" 表示她的職業角色，說明她實際上扮演的是護士這個職位。*  \n2. He speaks as if he knows everything.  \n*他說話的語氣彷彿他什麼都知道。這裡的 \"as\" 表示一種假設的狀態或模擬的態度，說明他說話的方式像在擁有全部知識。*  \n3. We live as neighbors in the same building.  \n*我們住在同一棟大樓裡，彼此是鄰居。這裡的 \"as\" 表示我們的關係狀態，說明我們是以鄰居的身份共同生活。*","locale":"zhtw"},{"id":84,"public_id":"019c5509-f758-7c6b-929e-da398c759d7d","category":"part of speech","value":"noun: youths","markdown":"**Structure:**  \nnoun: youths — this is a noun phrase that functions as a plural countable noun, referring to young people or individuals in their younger years. \"Youths\" is derived from the adjective \"youthful\" and is used to describe people who are young, typically in the age range of childhood or adolescence.\n\n**Explanation:**  \nIn English, \"youths\" is a plural noun that refers to young people, especially those who are not yet adults. It is not a verb or an adjective, but a word that names a group of people. The word is formed by adding \"-s\" to the base form \"youth,\" which means a young person or a period of early life. It is commonly used in formal or descriptive contexts to talk about young individuals in a general or abstract way.\n\n**English Examples:**  \n1. The school organized a program for youths to learn digital skills.  \n*這是一個關於年輕人學習數位技能的計畫，用來幫助他們發展未來的競爭力。*  \n2. Many youths in rural areas face limited access to education.  \n*在偏遠地區，許多年輕人因為資源不足而難以接受教育。*  \n3. The government launched a campaign to support youths in finding jobs.  \n*政府推出了一項計畫，幫助年輕人找到工作，以提升他們的經濟穩定性。*","locale":"zhtw"},{"id":85,"public_id":"019c5509-f759-72bb-8301-8942c2aa6dec","category":"part of speech","value":"verb: crave","markdown":"**Structure:**  \nverb: crave – this is a main verb that shows a strong desire or need. It is often used to describe wanting something deeply, even if it is not necessarily something physical or material. It can be used in both present and past tense, and it can be followed by a noun or a noun phrase to show what is being desired.\n\n**Explanation:**  \nThe verb \"crave\" expresses a powerful, often emotional or intense desire. Unlike simpler words like \"want\" or \"like,\" \"crave\" suggests that the feeling is strong and almost uncontrollable. It is commonly used when someone has a deep longing for something, such as food, attention, or a certain lifestyle. In context, it often carries a sense of urgency or personal need.\n\n**English Examples:**  \n1. She craves fresh coffee every morning before she starts work.  \n*她每天上班前都渴望喝一杯現磨咖啡。這顯示她對咖啡有強烈而穩定的需求，不是偶爾的喜好。*  \n2. Children often crave sweets during holidays, especially when they are excited.  \n*孩子在節日時特別渴望甜點，因為他們感到興奮，這顯示他們的渴望與情緒有關。*  \n3. He craves quiet time to think after a long day of meetings.  \n*他在一天長時間的會議後，渴望一段安靜的時間來思考。這說明他需要內在的平靜與反思。*","locale":"zhtw"},{"id":86,"public_id":"019c5509-f759-78b2-9c43-a51eaf3a4d49","category":"part of speech","value":"noun: mediocrity","markdown":"**Structure:**  \nnoun: mediocrity\n\n**Explanation:**  \n\"Mediocrity\" is a noun that refers to average or ordinary quality—something that is neither excellent nor poor, just in the middle. It describes a state of being ordinary, lacking distinction or special qualities. Unlike abstract concepts like \"happiness\" or \"freedom,\" \"mediocrity\" specifically refers to a lack of excellence or ambition. It is often used to describe people, achievements, or conditions that are unremarkable or unimpressive.\n\n**English Examples:**  \n1. The team’s performance this season was nothing short of mediocrity.  \n*這支球隊今年的表現完全就是平平無奇，沒有突出的表現。*  \n2. She avoided taking risks, which led to a life filled with mediocrity.  \n*她避免冒險，導致生活變得平庸無奇。*  \n3. In a competitive field, mediocrity is rarely rewarded.  \n*在競爭激烈的領域中，平庸的表現幾乎不會得到認可。*","locale":"zhtw"},{"id":87,"public_id":"019c5509-f759-7d4e-bcf5-7a6668e52952","category":"part of speech","value":"adverb: but","markdown":"**Structure:**  \nadverb: but — 用來連結兩個相反或對比的句子，表示然而、不過、但的意義，它不改變句子的主語或動作，僅說明語氣上的轉折。\n\n**Explanation:**  \n在英文中，but 是一個副詞，它的作用是讓兩個句子之間形成對比或轉折。它不表示動作，也不改變句子的主語或動詞，而是告訴讀者事情變得不同了或與之前相反。例如，當我們說我昨天很開心，但今天很煩，but 就讓我們知道情緒從正面轉成了負面。\n\n**English Examples:**  \n1. She studied hard for the exam, but she still failed.  \n*她為考試努力學習，但還是沒通過。這種情況顯示努力與結果之間的反差。*  \n2. The weather was sunny yesterday, but it rained today.  \n*昨天天氣晴朗，但今天下雨了。but 用來強調天氣的變化。*  \n3. He loves cooking, but he never tries new recipes.  \n*他喜歡煮菜，但從不嘗試新菜式。but 顯示出行為上的矛盾或不一致。*","locale":"zhtw"}],"created_at":"","updated_at":""}