{"id":14,"public_id":"","hash":"256d88d9e22cf9a138818b21a35ce766","text":"We pursue fervor as youths, but crave mediocrity as adults.","word_tokens":[{"text":"We","is_masked":false},{"text":" ","is_masked":false},{"text":"pursue","is_masked":true},{"text":" ","is_masked":false},{"text":"fervor","is_masked":true},{"text":" ","is_masked":false},{"text":"as","is_masked":true},{"text":" ","is_masked":false},{"text":"youths","is_masked":true},{"text":",","is_masked":false},{"text":" ","is_masked":false},{"text":"but","is_masked":true},{"text":" ","is_masked":false},{"text":"crave","is_masked":true},{"text":" ","is_masked":false},{"text":"mediocrity","is_masked":true},{"text":" ","is_masked":false},{"text":"as","is_masked":true},{"text":" ","is_masked":false},{"text":"adults","is_masked":true},{"text":".","is_masked":false}],"audio_url":"https://cdn.jsdelivr.net/gh/soft-rocks/soapstone-cdn@main/sentence/256d88d9e22cf9a138818b21a35ce766/audio.wav","translations":[{"id":14,"public_id":"019c6ee0-5a9e-7ee0-900a-85ba64424eee","locale":"zhtw","content":"少年時我們追求激情，成熟後卻迷戀平庸。"}],"words":[{"id":66,"public_id":"019c6ee3-5257-7340-b029-258bf4722f7d","word":"pursue","locale":"zhtw","markdown":"### 單字分析  \n- **詞性**: 動詞  \n- **音標**: /pɜːrˈsjuː/\n\n### 語境  \n在句子We pursue fervor as youths, but crave mediocrity as adults.中，\"pursue\" 表示年輕時熱情投入某種理想、追求某種目標或情感狀態，如熱情、理想或激情。這裡的pursue並非指物理上的追尋，而是心理或情感層面的投入與堅持。年輕人往往對生活抱有熱忱與理想，願意投入時間與精力去實現夢想，因此使用pursue來描寫這種積極、主動的追求行為。這種語境強調的是動力與持續性，與成年後更傾向於尋求穩定與平庸的態度形成對比，突顯了人生階段的轉變。\n\n### 定義與用法  \n1. 指主動地、持續地追求某個目標、理想、興趣或情感狀態，通常帶有熱情與投入的意味。  \n2. 動詞用法中，\"pursue\" 常用於描述個人對某種價值觀、夢想、目標或生活方式的長期投入，強調行動力與意志力。\n\n### English Examples  \n1. She pursues her passion for painting in every spare moment, even during busy workdays.  \n\u003cbr\u003e*在這句話中，\"pursue\" 作為動詞，描述她持續投入時間去追求對繪畫的熱愛，展現出主動與專注的態度，強調個人興趣的長期發展。*  \n2. The company is pursuing a new strategy to expand into international markets.  \n\u003cbr\u003e*這裡的 \"pursue\" 表示企業正在積極採取行動，朝向國際擴張這個目標前進，顯示出計畫性與行動導向。*  \n3. He pursued a career in science after completing his university studies.  \n\u003cbr\u003e*此句中 \"pursue\" 用來說明他選擇進入科學領域作為職業道路，強調從學術到職業的轉向與決心。*\n\n### 同義字與延伸詞彙  \n- **同義字**:  \n  - seek：強調尋找，可能較為廣泛，不必然帶有熱情或持續性。  \n  - strive：強調努力奮鬥，常與困難或挑戰相關，情感較強。  \n  - aim for：更側重目標導向，語氣較中性。  \n- **反義字**:  \n  - abandon（放棄）  \n  - accept（接受）  \n- **相關片語**:  \n  - pursue one's dreams（追求夢想）  \n  - pursue excellence（追求卓越）"},{"id":67,"public_id":"019c6ee3-5259-7157-a083-1ea1a5bda1df","word":"fervor","locale":"zhtw","markdown":"### 單字分析  \n- **詞性**: Noun（名詞）  \n- **音標**: /ˈfɜːvər/  \n\n### 語境  \n在句子We pursue fervor as youths, but crave mediocrity as adults.中，fervor描述年輕時對理想、熱情或目標的強烈追求。這裡的fervor並非指一般意義上的熱情，而是強調一種近乎執著、充滿激情的投入狀態，與成年後追求平庸、安逸的態度形成對比。這種語境下，fervor帶有情感張力與價值觀的轉變意味，突顯人生階段中內心動力的變化。\n\n### 定義與用法  \n1. 指強烈的熱情、熱忱或投入感，通常與某種信念、理想或活動相關，表現出高度的激情與專注。  \n2. 常用來描述個人對某項活動、目標或價值觀的深切投入，可能帶有理想主義或近乎執著的特質，但不一定是積極或成功的結果。\n\n### English Examples  \n1. She showed a fervor for learning new languages, spending hours each day practicing with native speakers.  \n\u003cbr\u003e*fervor在此作為名詞，表達她對學習語言的極度熱忱與投入，強調時間與行動上的持續性，凸顯其學習動力的強烈。*  \n2. The activist campaigned with a fervor that left the local community both inspired and concerned.  \n\u003cbr\u003e*fervor描寫運動人士的行動態度，表現出高度的熱情與行動力，帶有感染力與情感張力，說明其對社會議題的深切關懷。*  \n3. In the early days of the startup, the team worked with a fervor that pushed them past their limits.  \n\u003cbr\u003e*fervor在此描述創業團隊在初期的奮鬥狀態，強調他們不畏艱難、全力以赴的精神，展現出對事業的極致投入。*  \n\n### 同義字與延伸詞彙  \n- **同義字**:  \n  - zeal（更強調主動行動與熱切參與，常與idealism結合）  \n  - passion（更偏重個人情感與喜愛，可能較溫和）  \n  - enthusiasm（較常見於日常語境，強調興奮而非執著）  \n- **反義字**:  \n  - apathy（漠不關心）  \n  - mediocrity（平庸，缺乏熱情）  \n- **相關片語**:  \n  - fervor for justice（對正義的熱忱）  \n  - a fervor of activity（一種活躍的熱情）"},{"id":68,"public_id":"019c6ee3-5259-7e7e-8b58-6199b3325c9e","word":"youths","locale":"zhtw","markdown":"### 單字分析  \n- **詞性**: Noun（名詞）  \n- **音標**: /ˈjuːθz/  \n\n### 語境  \n在句子We pursue fervor as youths, but crave mediocrity as adults.中，\"youths\" 指的是年輕時的個人狀態，強調的是人在年少時期所表現出的熱情、理想與追求。這個詞在此語境中並非僅指年輕人這個年齡層，而是帶有情感與心理層面的意義——年輕時充滿熱情與衝動，願意為夢想奮鬥，因此使用 \"youths\" 來描寫那個充滿活力、不滿足於平庸的階段。它與後文的 \"adults\"（成年人）形成對比，凸顯年齡成長過程中價值觀的轉變。\n\n### 定義與用法  \n1. 指年輕人，特別是青少年或剛成年時期的個體，通常具有強烈的熱情、理想主義與探索精神。  \n2. 在語境中，\"youths\" 常用來代表一種心理狀態或人生階段，而非僅僅是年齡的標記，強調的是熱情洋溢的特質。\n\n### English Examples  \n1. During their youths, many students develop a deep passion for science and technology.  \n\u003cbr\u003e*\"youths\" 作為主詞，表示年輕學生在成長過程中對科學技術產生熱情，展現出探索與學習的動力，體現了年輕人對知識的渴望與投入。*  \n2. The film captures the struggles of youths trying to find their identity in a fast-changing society.  \n\u003cbr\u003e*\"youths\" 作為主詞，描述一群年輕人在社會快速變遷中尋找自我認同，凸顯其心理與社會層面的挑戰與成長。*  \n3. In the 1980s, many youths embraced rock music as a form of rebellion.  \n\u003cbr\u003e*\"youths\" 作為主詞，表達年輕人將搖滾樂視為反抗主流價值的象徵，強調其在文化與情感上的自主性與創造力。*  \n\n### 同義字與延伸詞彙  \n- **同義字**:  \n\t- teenagers（更強調年齡層，通常指13至19歲之間的青少年）  \n\t- young people（較為廣泛，不具情感或心理色彩）  \n\t- adolescents（偏重心理發展階段，常見於心理學或教育學語境）  \n- **反義字**: adults（成年人，通常代表成熟、穩定、追求現實）  \n- **相關片語**:  \n\t- in one's youth（在某人年輕時）  \n\t- the youth of a country（一個國家的年輕一代）"},{"id":69,"public_id":"019c6ee3-525a-7cc9-ae7c-c028e2aa3d87","word":"crave","locale":"zhtw","markdown":"### 單字分析  \n- **詞性**: Verb（動詞）  \n- **音標**: /kræv/  \n\n### 語境  \n在句子We pursue fervor as youths, but crave mediocrity as adults.中，\"crave\" 用來描述成年人對平庸（mediocrity）的強烈渴望或需求。這裡的語境強調一種心理上的渴望，與年輕時熱情追求卓越形成對比。這種用法反映出人們在成長過程中，隨著經歷增加，可能逐漸失去對理想或激情的追求，轉而更傾向於安於現狀、避免風險或壓力。因此，\"crave\" 在此並非僅是想要的簡單表達，而是帶有情感深度與心理動機的渴望，表現出內在的不滿足或對穩定的依賴。\n\n### 定義與用法  \n1. 表示強烈地想要某物，通常帶有情感或心理上的渴望，不一定是實際的行動或現實條件。這種渴望可能出於情感需求、心理安慰或對某種狀態的偏好。  \n2. 常用於描述對某種價值觀、生活方式、情感狀態或抽象事物的深切向往，例如對自由、愛、成功或安逸的渴望。  \n\n### English Examples  \n1. She craves peace after years of constant travel and work.  \n\u003cbr\u003e*她渴望平靜，因為多年來一直在旅行與工作之間奔波。此處 \"crave\" 表達了對安靜生活的強烈心理需求，強調一種內在的、持續性的渴望，而非偶然的願望。*  \n2. Many young people crave recognition in the digital age.  \n\u003cbr\u003e*在數位時代，許多年輕人渴望被認可。這裡 \"crave\" 描述了社會環境中人們對社會肯定的強烈需求，反映出現代社會對成功與關注的追求。*  \n3. He craves the simplicity of rural life, far from city noise.  \n\u003cbr\u003e*他渴望遠離城市喧囂的鄉村生活簡單與寧靜。此句中 \"crave\" 用來表現對與都市生活截然不同的自然環境的深切向往，展現了對生活質感的追求。*  \n\n### 同義字與延伸詞彙  \n- **同義字**:  \n  - long for: 常見於較詩意或情感化的語境，強調對某事物的深切期盼，但不強調強烈的行動或心理動力。  \n  - yearn for: 比 \"crave\" 更強調內在的、無法抑制的渴望，常帶有痛苦或失落感。  \n  - desire for: 更中性，可用於描述普遍的興趣或偏好，程度較弱。  \n- **反義字**:  \n  - reject (拒絕)、avoid (迴避)、dislike (不喜歡)  \n- **相關片語**:  \n  - crave attention（渴望關注）  \n  - crave freedom（渴望自由）  \n  - crave comfort（渴望舒適）"},{"id":70,"public_id":"019c6ee3-525b-7772-89f7-cff9462f42ce","word":"mediocrity","locale":"zhtw","markdown":"### 單字分析  \n- **詞性**: 名詞 (Noun)  \n- **音標**: /ˌmɛdi.əˈkrɪ.ti/\n\n### 語境  \n在句子We pursue fervor as youths, but crave mediocrity as adults.中，mediocrity指的是人在成長過程中從年輕時追求熱情、理想與卓越，轉為成年後更傾向於滿足於平庸、中庸的生活狀態。這個詞用來描寫一種心理或價值觀的轉變——年輕人渴望突破與激情，而成年人則因現實壓力或安全感需求，選擇接受平凡與不特別的生活。因此，在此語境下，mediocrity並非單純指普通，而是帶有負面情感色彩的對卓越的放棄，表現出一種內心的退縮與妥協。\n\n### 定義與用法  \n1. 指一種平庸、缺乏卓越或獨特特質的狀態，通常帶有輕微的貶義，用來形容某人或某事物沒有達到應有的高度或品質。  \n2. 在心理層面，也可指個人在成長過程中對成功或成就的認知轉變，從追求卓越轉向接受中庸與穩定。\n\n### English Examples  \n1. The company’s new product line is a clear example of mediocrity in design — it lacks innovation and fails to stand out in a competitive market.  \n\u003cbr\u003e*mediocrity在此作為名詞，用來形容產品設計缺乏創意與獨特之處，表達一種對品質的降級，並指出其在市場中的無競爭力。*  \n2. Despite his talent, he settled for mediocrity in his career, choosing safe jobs over ambitious challenges.  \n\u003cbr\u003e*mediocrity作為主詞，描述他在職業生涯中選擇安於平凡，而非追求突破，強調個人選擇與價值觀的妥協。*  \n3. The classroom environment promotes mediocrity by rewarding students only for passing exams, not for deep understanding or creativity.  \n\u003cbr\u003e*mediocrity在此作為抽象概念，指出教育制度如何透過評分機制導致學生只追求及格而非真正學習，進而產生平庸的學習成果。*\n\n### 同義字與延伸詞彙  \n- **同義字**:  \n\t- average（較中性，指平均值，不帶情感色彩）  \n\t- banality（較強負面，指乏味、無趣的平庸）  \n\t- ordinariness（較正式，指日常性、平凡性）  \n- **反義字**:  \n\t- excellence（卓越）  \n\t- extraordinariness（非凡性）  \n\t- distinction（特質或區別）  \n- **相關片語**:  \n\t- fall into mediocrity（陷入平庸）  \n\t- avoid mediocrity（避免平庸）"},{"id":71,"public_id":"019c6ee3-525b-7e15-a610-ed52c1f36145","word":"adults","locale":"zhtw","markdown":"### 單字分析  \n- **詞性**: 名詞 (Noun)  \n- **音標**: /ˈædʌlt/  \n\n### 語境  \n在句子We pursue fervor as youths, but crave mediocrity as adults.中，adults指的是成年後的人，特別是在人生階段轉變後，人們價值觀與行為模式可能與年輕時有所不同。這裡的adults並非僅指生理上的成熟，而是指心理與社會角色上的成熟，強調人在成長過程中，從原本熱情追求卓越的狀態，轉為更傾向安於平庸、追求穩定與安全的狀態。此語境中，adults帶有批判性與反思性，暗示社會或個人在成長過程中可能失去原本的熱情與冒險精神。\n\n### 定義與用法  \n\t1. 指生理或心理上已經成長為成年人的人，通常在18歲以上，具有獨立生活與社會責任的能力。  \n\t2. 在語境中，也可引申為成熟後的狀態，用以對比年輕時的熱情與衝動，反映人生階段的轉變與價值觀的調整。\n\n### English Examples  \n1. Many adults today prioritize work-life balance over career advancement.  \n\u003cbr\u003e*adults在此作為主詞，表示現代社會中成年後的人群，他們更重視生活品質與個人幸福，而非單純追求職業成就。*  \n2. As adults, we often make decisions based on practicality rather than passion.  \n\u003cbr\u003e*adults作為主詞，描寫人在成年後的思考方式轉為務實，與年輕時的熱情或理想有所差異。*  \n3. The school introduced a program to help teens transition into adult responsibilities.  \n\u003cbr\u003e*adults在此作為抽象概念，代表需要承擔家庭、社會責任的成熟階段，強調從青少年到成年之間的過渡。*  \n\n### 同義字與延伸詞彙  \n- **同義字**:  \n\t- mature individuals（更強調心理成熟）  \n\t- grown-ups（較口語，帶有日常對話色彩）  \n\t- elders（強調年長或經驗豐富，語境更廣）  \n- **反義字**: youths, children  \n- **相關片語**:  \n\t- grow up into adults  \n\t- become an adult  \n\t- adult life  \n\t- adult responsibilities"}],"grammars":[{"id":88,"public_id":"019c6ee3-2b35-7854-b9c0-f4cef6a30e25","category":"Clause Type","value":"Compound Sentence with two parallel adverbial clauses","markdown":"### 文法結構  \n- **公式**: [主句] + [並列的副詞從句，結構為：主語 + 動詞原形（或情態動詞）+ 動詞原形]  \n- **組成細節**: 這個文法結構由一個主句和兩個並列的副詞從句組成，兩個從句在語意上具有對比或平行關係，通常用連接詞如 \"when\", \"as\", 或 \"while\" 來連結。副詞從句說明時間、條件或方式，與主句共同構成完整語意，但各自獨立存在，不依賴主句的動作。\n\n### 原理解析  \n這種文法結構能清晰呈現兩個不同階段或情境下的行為對比，強調時間或狀態的變化。透過並列的副詞從句，語氣更顯生動且具有反思性，讓讀者能感受到個人成長過程中價值觀的轉變。它不只描述事實，也傳達一種內在的矛盾或覺醒，使句子更具情感張力與哲思深度。\n\n**例句:**  \n1. She studied hard in school, but relaxed easily after graduation.  \n\u003cbr\u003e在校期間努力學習，畢業後卻輕鬆自在。說明學習態度在人生階段轉變時產生了明顯差異。  \n\n2. They traveled abroad during summer vacation, yet stayed home during winter months.  \n\u003cbr\u003e夏天會出國旅行，冬天則選擇待在家裡。表現出季節與個人選擇之間的對比關係。  \n\n3. He worked late every night, though he always felt tired by morning.  \n\u003cbr\u003e他每晚都加班，但清晨總是感到疲憊。呈現一種持續行動與實際感受之間的矛盾。","locale":"zhtw"},{"id":89,"public_id":"019c6ee3-2b38-72ab-ac77-63e653b95f22","category":"Prepositional Usage","value":"Preposition 'as' used for role or state in both clauses","markdown":"### 文法結構  \n- **公式**: Subject + verb + as + noun phrase (role or state)  \n- **組成細節**: \"as\" 在此用法中不表示時間或方式，而是引出某人所扮演的角色或處於的狀態。主詞執行動作或處於某種情境時，後面接 \"as\" 加上名詞短語，說明該人當時的角色或狀態，例如 \"as a teacher\" 或 \"as a student\"。\n\n### 原理解析  \n這個文法用來描寫一個人在不同階段或情境下所扮演的身份或處於的心理狀態。它強調的不是時間順序，而是當下的狀態或角色。這種結構讓語句更生動，能清楚傳達一個人在特定情境中的定位，帶有觀察性與反思的語氣，常見於個人成長或社會觀察的討論中。\n\n**例句:**  \n1. She works hard as a freelancer, but feels restless as a full-time employee.  \n\u003cbr\u003e*她作為自由工作者時努力工作，但作為全職員工時卻感到不安。說明她在不同職業狀態下情緒與角色的差異。*  \n2. He speaks confidently as a leader, but hesitates as a student in class.  \n\u003cbr\u003e*他作為領導者時表現自信，但在課堂上作為學生時卻會猶豫。顯示同一個人在不同角色中的行為差異。*  \n3. They play together as siblings, but act independently as adults.  \n\u003cbr\u003e*他們童年時作為兄弟姐妹一起玩耍，但成年後各自獨立行事。呈現角色轉變如何影響人際互動。*","locale":"zhtw"},{"id":90,"public_id":"019c6ee3-2b38-7cb5-891d-39c9be2b15e9","category":"Sentence Complexity","value":"Compound Sentence","markdown":"### 文法結構  \n- **公式**: Two independent clauses joined by a coordinating conjunction (such as and, but, or, yet, so, for)  \n- **組成細節**: 一個複合句由兩個獨立的句子組成，每個句子都能獨立成句，並由一個連接詞（如 but、or、so）連結，表達兩個相關但不同的想法或狀態。\n\n### 原理解析  \n這種文法結構用來呈現兩個彼此對比或相關的觀點，讓語氣更豐富、層次更清楚。它強調兩個事件或想法之間的關係，例如矛盾、轉變或因果，使表達更具說服力與情感張力。在寫作中，這種結構能幫助讀者理解人物的變化或情境的發展。\n\n**例句:**  \n1. She studied hard in college, but she lost interest in her career after graduation.  \n\u003cbr\u003e*她在大學期間努力學習，但畢業後對自己的職業失去興趣。說明從努力到放棄的轉變，呈現人生階段的落差。*  \n2. The weather was perfect for hiking, so we decided to go early in the morning.  \n\u003cbr\u003e*天氣很適合遠足，因此我們決定早上出發。顯示因果關係，說明決定如何根據環境做出反應。*  \n3. He wanted to travel abroad, yet he had no money to support the trip.  \n\u003cbr\u003e*他想出國旅行，卻沒有錢來支持這趟旅程。表現出理想與現實之間的衝突，強調矛盾情境。*","locale":"zhtw"},{"id":91,"public_id":"019c6ee3-2b39-7845-98c3-36700ad1bd39","category":"Information Structure","value":"Contrast through conjunction 'but'","markdown":"### 文法結構  \n- **公式**: Subject + pursue/seek/aspire + [noun/gerund] + but + Subject + crave/long for + [noun/gerund]  \n- **組成細節**: 此結構以主詞開頭，描述某個階段的行為或追求，接著用but引出與前半句形成對比的另一種行為或狀態。這種對比強調兩者之間的差異，常見於描述人生階段、價值觀轉變或個人成長過程中的矛盾。\n\n### 原理解析  \nbut在此作為對比連詞，用來突顯兩個看似矛盾或相反的狀態之間的張力。它不只連結兩個句子，更傳達出一種內在的矛盾感或成長中的掙扎。這種語氣常帶有反思性，讓讀者感受到行為與結果之間的落差，進而引發對自身選擇或價值觀的思考。\n\n**例句:**  \n1. She dreamed of traveling the world as a student, but settled for a stable office job after graduation.  \n\u003cbr\u003e*學生時期渴望環遊世界，畢業後卻選擇穩定的辦公室工作，顯示出理想與現實之間的落差。*  \n2. He once wanted to become a rock star, but now he just enjoys quiet evenings at home.  \n\u003cbr\u003e*過去追求極致的音樂夢想，現在卻寧願過著平靜的生活，展現出人生方向的轉變。*  \n3. They studied hard to succeed in business, but ended up choosing a simple life in the countryside.  \n\u003cbr\u003e*原本努力追求商業成功，最終卻選擇了鄉間簡單安穩的生活，凸顯出對幸福定義的重新審視。*","locale":"zhtw"},{"id":92,"public_id":"019c6ee3-2b3a-70da-9e81-2f9613efb924","category":"Verb Tense \u0026 Aspect","value":"Present simple tense for both verbs","markdown":"### 文法結構  \n- **公式**: Subject + verb (base form) in present simple tense  \n- **組成細節**: 主語（如 I, they, we）直接搭配動詞的基礎形式（如 go, work, live），不加助動詞或時態變化，用來描述普遍事實、習慣性動作或目前的狀態。\n\n### 原理解析  \n現在我式時態（present simple）用來表達一個持續存在、不變或經常發生的動作或事實，它不強調時間點或完成度，而是傳達一種穩定、日常的語氣。這種時態適合用在描述個人習慣、普遍真理或當前的狀態，讓句子聽起來自然且具有一種平常的感覺，不會讓讀者覺得事情是剛發生或將要發生。\n\n**例句:**  \n1. She reads books every evening.  \n\u003cbr\u003e*她每天晚上都讀書。這句說明她有一個穩定的習慣，使用現在簡單式強調這個行為是長期且持續的。*  \n2. The sun rises in the east.  \n\u003cbr\u003e*太陽從東方升起。這是一個自然現象，用現在簡單式表示普遍事實，不涉及時間變化。*  \n3. We live in a small town.  \n\u003cbr\u003e*我們住在一個小鎮。這句描述目前的生活環境，使用現在簡單式傳達一個持續的狀態。*","locale":"zhtw"},{"id":93,"public_id":"019c6ee3-2b3a-7a29-8fc0-15246054a0d4","category":"Modifier \u0026 Phrases","value":"Gerund phrase 'pursue fervor' as main verb construction","markdown":"### 文法結構  \n- **公式**: Subject + verb + object (where the verb is a gerund, i.e., a verb ending in -ing that functions as a noun)  \n- **組成細節**: 在這個結構中，主語（Subject）執行一個以-ing結尾的動名詞（gerund）動作，這個動作作為句子的主語或核心動詞使用，通常表達一種持續性、習慣性或抽象的行為。例如，\"swimming\" 在 \"I enjoy swimming\" 中，是作為一個名詞性成分出現，表示一種活動。\n\n### 原理解析  \n這種文法結構讓句子能以更流暢的方式描述一種持續性的行為或個人偏好。使用動名詞（gerund）時，語氣更傾向於客觀、描述性，而不是強調時間點或完成度。它傳達出一種習慣、傾向或生活態度，讓讀者能感受到說話者對某種生活方式的選擇或感受。\n\n**例句:**  \n1. She loves dancing at night.  \n\u003cbr\u003e*她晚上喜歡跳舞。這個句子說明她對跳舞這種活動有持續的喜好，用 \"loves dancing\" 表達一種習慣性的偏好，而非單次行為。*  \n2. He avoids drinking coffee in the morning.  \n\u003cbr\u003e*他早上避免喝咖啡。這裡 \"avoiding drinking\" 是一個動名詞短語，說明他對某種行為的刻意回避，展現出個人習慣與選擇。*  \n3. They enjoy hiking in the mountains.  \n\u003cbr\u003e*他們喜歡在山裡遠足。這個句子中 \"enjoy hiking\" 用動名詞表達一種持續性的活動喜愛，強調的是活動本身帶來的樂趣。*","locale":"zhtw"},{"id":94,"public_id":"019c6ee3-2b3b-7084-a5ba-6966e639ffba","category":"Conjunction \u0026 Cohesion","value":"Coordinating conjunction 'but' linking two contrasting clauses","markdown":"### 文法結構  \n- **公式**: [Subject + verb (present/past) + coordinating conjunction \"but\" + Subject + verb (present/past)]  \n- **組成細節**: \"But\" 用來連接兩個意思相反或對比的句子，讓讀者清楚看到兩者之間的差異。前半句描述某種狀態或行為，後半句則轉向另一種相反或較弱的狀態或行為。\n\n### 原理解析  \n使用 \"but\" 的目的在於強調兩種情境之間的對比，這種對比能讓語氣更生動，也讓觀眾或聽眾更能感受到變化或矛盾。它傳達的語氣通常是反思性或批判性的，常見於個人成長、價值觀轉變或生活經驗的總結中。\n\n**例句:**  \n1. She studied hard for the exam, but still didn’t pass.  \n\u003cbr\u003e她為考試努力學習，但還是沒通過。說明努力與結果之間的落差，突顯現實與期望的對比。  \n2. He wanted to travel the world, but ended up staying at home.  \n\u003cbr\u003e他想環遊世界，但最終還是待在家中。表現出理想與實際之間的差距，帶有輕微的遺憾感。  \n3. They planned a surprise party, but the guest list was too small.  \n\u003cbr\u003e他們計劃了一場驚喜派對，但來賓人數太少。顯示計畫與實際情況之間的不匹配，強調結果的不如預期。","locale":"zhtw"}],"created_at":"","updated_at":""}